schreibfaul1/ESP32-MiniWebRadio/src/common.h
struct timecounter_s {
    uint8_t timer = 0;
    uint8_t factor = 2;
};
struct irButtons {
    int16_t val;
    char*   label;
};
struct settings_s {
    irButtons    irbuttons[45];
    uint8_t      numOfIrButtons = 0;
    ps_ptr<char> lastconnectedhost = {};
    ps_ptr<char> lastconnectedfile = {};
};

struct volume_s {
    uint8_t cur_volume = 21;
    uint8_t ringVolume = 21;
    uint8_t volumeAfterAlarm = 12;
    uint8_t volumeSteps = 21;
    uint8_t volumeCurve = 1;
};

struct bt_emitter_s {
    bool         found = false;
    bool         connect = false;
    bool         power_state = false;
    bool         play = true; // play: true, pause: false
    uint8_t      volume = 0;
    ps_ptr<char> mode = {};
    ps_ptr<char> version = {};
};

struct tone_s {
    int16_t LP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t BP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t HP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t BAL = 0; // -16...0....+16         audioI2S
};

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

// prototypes (main.cpp)
bool         SD_MMC_exists(const char* path);
boolean      defaultsettings();
void         updateSettings();
void         urldecode(char* str);
void         fall_asleep();
void         wake_up();
void         setRTC(ps_ptr<char> TZString);
boolean      isAlarm(uint8_t weekDay, uint8_t alarmDays, uint16_t minuteOfTheDay, int16_t* alarmTime);
boolean      copySDtoFFat(const char* path);
void         showStreamTitle(ps_ptr<char> streamTitle);
void         showLogoAndStationName(bool force);
void         showFileLogo(uint8_t state);
void         showFileName(const char* fname);
void         showPlsFileNumber();
void         showAudioFileNumber();
void         display_sleeptime(int8_t ud = 0);
boolean      drawImage(const char* path, uint16_t posX, uint16_t posY, uint16_t maxWidth = 0, uint16_t maxHeigth = 0);
boolean      isAudio(File file);
boolean      isAudio(const char* path);
boolean      isPlaylist(File file);
bool         connectToWiFi();
void         setWiFiCredentials(const char* ssid, const char* password);
ps_ptr<char> scaleImage(ps_ptr<char> path);
void         setVolume(uint8_t vol);
uint8_t      downvolume();
uint8_t      upvolume();
void         setStation(uint16_t sta);
const char*  getFlagPath(uint16_t station);
void         nextStation();
void         prevStation();
void         setStationByNumber(uint16_t staNr);
void         StationsItems();
void         setStationViaURL(const char* url, const char* extension);
void         savefile(ps_ptr<char> fileName, uint32_t contentLength, ps_ptr<char> contenttype);
ps_ptr<char> setI2STone();
void         SD_playFile(ps_ptr<char> pathWoFileName, const char* fileName);
void         SD_playFile(ps_ptr<char> path, uint32_t resumeFilePos = 0, bool showFN = true);
bool         SD_rename(const char* src, const char* dest);
bool         SD_newFolder(const char* folderPathName);
bool         SD_delete(const char* itemPath);
bool         preparePlaylistFromDLNAFolder();
bool         preparePlaylistFromFile(const char* path);
bool         preparePlaylistFromSDFolder(const char* path);
void         sortPlayListAlphabetical();
void         sortPlayListRandom();
void         processPlaylist(boolean first = false);
void         changeState(int32_t state);
void         connecttohost(ps_ptr<char> host);
void         connecttoFS(const char* FS, const char* filename, uint32_t fileStartTime = 0);
void         stopSong();
void         placingGraphicObjects();
void         muteChanged(bool m);
void         setTimeCounter(uint8_t sec);
ps_ptr<char> get_WiFi_PW(const char* ssid);
void         my_audio_info(Audio::msg_t m);
void         on_dlna_client(const DLNA_Client::msg_s& msg);
void         on_kcx_bt_emitter(const KCX_BT_Emitter::msg_s& msg);
void         on_websrv(const WebSrv::msg_s& msg);

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline const char* byte_to_binary(int8_t x) { // e.g. alarmdays
    static char b[9];
    b[0] = '\0';

    int32_t z;
    for (z = 128; z > 0; z >>= 1) { strcat(b, ((x & z) == z) ? "1" : "0"); }
    return b;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline uint32_t simpleHash(const char* str) {
    if (str == NULL) return 0;
    uint32_t hash = 0;
    for (int32_t i = 0; i < strlen(str); i++) {
        if (str[i] < 32) continue; // ignore control sign
        hash += (str[i] - 31) * i * 32;
    }
    return hash;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline int32_t str2int(const char* str) {
    int32_t len = strlen(str);
    if (len > 0) {
        for (int32_t i = 0; i < len; i++) {
            if (!isdigit(str[i])) {
                log_e("NaN");
                return 0;
            }
        }
        return stoi(str);
    }
    return 0;
}

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline char* int2str(int32_t val) {
    static char ret[12];
    itoa(val, ret, 10);
    return ret;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline void trim(char* s) {
    // fb   trim in place
    char* pe;
    char* p = s;
    while (isspace(*p)) p++; // left
    pe = p;                  // right
    while (*pe != '\0') pe++;
    do { pe--; } while ((pe > p) && isspace(*pe));
    if (p == s) {
        *++pe = '\0';
    } else { // move
        while (p <= pe) *s++ = *p++;
        *s = '\0';
    }
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline bool startsWith(const char* base, const char* searchString) {
    if (base == NULL) {
        log_e("base = NULL");
        return false;
    } // guard
    if (searchString == NULL) {
        log_e("searchString == NULL");
        return false;
    } // guard
    if (strlen(searchString) > strlen(base)) return false;
    char c;
    while ((c = *searchString++) != '\0')
        if (c != *base++) return false;
    return true;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

